# Pandas Serisi Oluşturmak

In [1]:
    import pandas as pd

In [3]:
pd.Series([12,24,36,54,65])

0    12
1    24
2    36
3    54
4    65
dtype: int64

In [4]:
seri = pd.Series([12,24,36,54,65])

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.size

5

In [9]:
seri.ndim

1

In [10]:
seri.iloc[[2,3]]

2    36
3    54
dtype: int64

In [11]:
seri.values

array([12, 24, 36, 54, 65], dtype=int64)

In [12]:
seri.head()

0    12
1    24
2    36
3    54
4    65
dtype: int64

In [13]:
seri.tail(3)

2    36
3    54
4    65
dtype: int64

In [14]:
# index isimlendirmesi

In [15]:
pd.Series([44,69,35,111,24,566])

0     44
1     69
2     35
3    111
4     24
5    566
dtype: int64

In [22]:
a=pd.Series([44,69,35,111,24,566],index=[1,3,5,7,9,11])
a

1      44
3      69
5      35
7     111
9      24
11    566
dtype: int64

In [33]:
a[1:3]

3    69
5    35
dtype: int64

In [24]:
a.loc[11]

566

In [25]:
pd.Series([44,69,35,111,24,566],index=["a","b","c","d","e","f"])

a     44
b     69
c     35
d    111
e     24
f    566
dtype: int64

In [26]:
seri = pd.Series([44,69,35,111,24,566],index=["a","b","c","d","e","f"])

In [27]:
seri["a"]

44

In [28]:
seri["a":"d"] # harflerde "d" de dahil oldu

a     44
b     69
c     35
d    111
dtype: int64

In [34]:
# sozluk uzerinden liste oluşturmak

In [35]:
# sozluk = pd.Series({"reg":10,"loc":11,"cart":12})

In [37]:
sozluk = {"reg":10,"loc":11,"cart":12}

In [38]:
seri = pd.Series(sozluk)
seri

reg     10
loc     11
cart    12
dtype: int64

## İki Seriyi Birleştime (Concantaion)

In [39]:
pd.concat([seri,seri])

reg     10
loc     11
cart    12
reg     10
loc     11
cart    12
dtype: int64

## Eleman İşlemeri

In [40]:
import numpy as np

In [41]:
a = np.array([19,25,32,64,555])
seri = pd.Series(a)
seri

0     19
1     25
2     32
3     64
4    555
dtype: int32

In [42]:
seri[0:3]

0    19
1    25
2    32
dtype: int32

In [43]:
seri = pd.Series([121,533,93,14], index = ["reg","loc","cart","rf"])

In [44]:
seri

reg     121
loc     533
cart     93
rf       14
dtype: int64

In [45]:
seri.index

Index(['reg', 'loc', 'cart', 'rf'], dtype='object')

In [46]:
seri.values

array([121, 533,  93,  14], dtype=int64)

In [47]:
seri.keys

<bound method Series.keys of reg     121
loc     533
cart     93
rf       14
dtype: int64>

In [48]:
list(seri)

[121, 533, 93, 14]

In [94]:
list(seri.items())

[('reg', 121), ('loc', 130), ('cart', 93), ('rf', 14)]

In [50]:
# eleman sorgulama

In [51]:
"reg" in seri

True

In [52]:
"ra" in seri

False

In [53]:
seri["reg"]

121

In [55]:
seri[["rf","loc"]]

rf      14
loc    533
dtype: int64

In [57]:
seri["loc"] = 130

In [58]:
seri["loc"]

130

In [60]:
seri["reg":"loc"]

reg    121
loc    130
dtype: int64

# 

# Pandas DataFrame Oluşturmak

In [61]:
import pandas as pd

In [62]:
l = [2,54,68,18,62]

In [63]:
l

[2, 54, 68, 18, 62]

In [65]:
pd.DataFrame(l,columns = ["degisken_ismi"])

   degisken_ismi
0              2
1             54
2             68
3             18
4             62

In [66]:
import numpy as np

In [69]:
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [72]:
pd.DataFrame(m,columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [73]:
# df isimlendirme

In [74]:
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [75]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [76]:
df.columns = ["deg1","deg2","deg3"]

In [77]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [78]:
type(df)

pandas.core.frame.DataFrame

In [80]:
pd?

Type:        module
String form: <module 'pandas' from 'C:\\Users\\Fettah\\pyhton\\lib\\site-packages\\pandas\\__init__.py'>
File:        c:\users\fettah\pyhton\lib\site-packages\pandas\__init__.py
Docstring:
pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

In [81]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [82]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [84]:
df.shape

(3, 3)

In [85]:
df.ndim

2

In [86]:
df.size

9

In [87]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [103]:
type(df.values)

numpy.ndarray

In [88]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [89]:
df.columns

Index(['deg1', 'deg2', 'deg3'], dtype='object')

In [101]:
df.items

<bound method DataFrame.items of    deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9>

In [97]:
df.keys

<bound method NDFrame.keys of    deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9>

In [102]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [105]:
list(df.items())

[('deg1',
  0    1
  1    4
  2    7
  Name: deg1, dtype: int32),
 ('deg2',
  0    2
  1    5
  2    8
  Name: deg2, dtype: int32),
 ('deg3',
  0    3
  1    6
  2    9
  Name: deg3, dtype: int32)]

In [110]:
list(df.values)

[array([1, 2, 3]), array([4, 5, 6]), array([7, 8, 9])]

In [111]:
list(df.keys())

['deg1', 'deg2', 'deg3']

In [113]:
df['deg1']

0    1
1    4
2    7
Name: deg1, dtype: int32

# 

# Eleman İşlemleri

In [123]:
import numpy as np
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)

In [124]:
s1,s2,s3

(array([5, 6, 4, 1, 2]), array([3, 4, 5, 6, 2]), array([7, 7, 5, 9, 4]))

In [125]:
sozluk ={"var1":s1,"var2":s2,"var3":s3 }
sozluk

{'var1': array([5, 6, 4, 1, 2]),
 'var2': array([3, 4, 5, 6, 2]),
 'var3': array([7, 7, 5, 9, 4])}

In [158]:
df = pd.DataFrame(sozluk)

In [159]:
df

   var1  var2  var3
0     5     3     7
1     6     4     7
2     4     5     5
3     1     6     9
4     2     2     4

In [160]:
df[0:1]

   var1  var2  var3
0     5     3     7

In [161]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [162]:
df.index = ["a","b","c","d","e"]

In [163]:
df

   var1  var2  var3
a     5     3     7
b     6     4     7
c     4     5     5
d     1     6     9
e     2     2     4

In [164]:
df["a":"c"]

   var1  var2  var3
a     5     3     7
b     6     4     7
c     4     5     5

In [165]:
# silme işlemi

In [166]:
df.drop("a",axis=0)

   var1  var2  var3
b     6     4     7
c     4     5     5
d     1     6     9
e     2     2     4

>  # Not : 
>
>   *  ***axis = 0   burada satır oldu***
>
>   *  ***axis = 1   da sütun oldu***

In [167]:
df

   var1  var2  var3
a     5     3     7
b     6     4     7
c     4     5     5
d     1     6     9
e     2     2     4

In [168]:
df.drop("a" , axis=0 , inplace = True)

In [169]:
df

   var1  var2  var3
b     6     4     7
c     4     5     5
d     1     6     9
e     2     2     4

In [170]:
# fancy

In [172]:
l=["c","e"]

In [173]:
df.drop(l,axis=0,#inplace=True)

In [174]:
df

   var1  var2  var3
b     6     4     7
d     1     6     9

In [175]:
# degiskenler için

In [177]:
df

   var1  var2  var3
b     6     4     7
d     1     6     9

In [176]:
"var1" in df

True

In [179]:
m=["var1","var2","var4"]

In [180]:
for i in m:
    print(i in df)

True
True
False

In [182]:
df = pd.DataFrame(sozluk)

In [183]:
df

   var1  var2  var3
0     5     3     7
1     6     4     7
2     4     5     5
3     1     6     9
4     2     2     4

In [187]:
df["var4"] = df["var1"] * df["var2"]

In [188]:
df

   var1  var2  var3  var4
0     5     3     7    15
1     6     4     7    24
2     4     5     5    20
3     1     6     9     6
4     2     2     4     4

In [189]:
# degisken silmek

In [190]:
df.drop("var4",axis = 1)

   var1  var2  var3
0     5     3     7
1     6     4     7
2     4     5     5
3     1     6     9
4     2     2     4

In [191]:
df

   var1  var2  var3  var4
0     5     3     7    15
1     6     4     7    24
2     4     5     5    20
3     1     6     9     6
4     2     2     4     4

In [192]:
n = ["var1","var2"]

In [193]:
df.drop(n,axis=1) # fancy

   var3  var4
0     7    15
1     7    24
2     5    20
3     9     6
4     4     4

# Gözlem ve Değişken Seçimi : loc & iloc

In [1]:
import numpy as np
import pandas as pd

In [6]:
?np.random.randint

Docstring:
randint(low, high=None, size=None, dtype=int)

Return random integers from `low` (inclusive) to `high` (exclusive).

Return random integers from the "discrete uniform" distribution of
the specified dtype in the "half-open" interval [`low`, `high`). If
`high` is None (the default), then results are from [0, `low`).

.. note::
    New code should use the ``integers`` method of a ``default_rng()``
    instance instead; see `random-quick-start`.

Parameters
----------
low : int or array-like of ints
    Lowest (signed) integers to be drawn from the distribution (unless
    ``high=None``, in which case this parameter is one above the
    *highest* such integer).
high : int or array-like of ints, optional
    If provided, one above the largest (signed) integer to be drawn
    from the distribution (see above for behavior if ``high=None``).
    If array-like, must contain integer values
size : int or tuple of ints, optional
    Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
    ``m * n * k`` samples are drawn.  Default is None, in which case a
    single value is returned.
dtype : dtype, optional
    Desired dtype of the result. Byteorder must be native.
    The default value is int.

    .. versionadded:: 1.11.0

Returns
-------
out : int or ndarray of ints
    `size`-shaped array of random integers from the appropriate
    distribution, or a single such random int if `size` not provided.

See Also
--------
random_integers : similar to `randint`, only for the closed
    interval [`low`, `high`], and 1 is the lowest value if `high` is
    omitted.
Generator.integers: which should be used for new code.

Examples
--------
>>> np.random.randint(2, size=10)
array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
>>> np.random.randint(1, size=10)
array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

Generate a 2 x 4 array of ints between 0 and 4, inclusive:

>>> np.random.randint(5, size=(2, 4))
array([[4, 0, 2, 1], # random
       [3, 2, 2, 0]])

Generate a 1 x 3 array with 3 different upper bounds

>>> np.random.randint(1, [3, 5, 10])
array([2, 2, 9]) # random

Generate a 1 by 3 array with 3 different lower bounds

>>> np.random.randint([1, 5, 7], 10)
array([9, 8, 7]) # random

Generate a 2 by 4 array using broadcasting with dtype of uint8

>>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
array([[ 8,  6,  9,  7], # random
       [ 1, 16,  9, 12]], dtype=uint8)
Type:      builtin_function_or_method

In [4]:
m = np.random.randint(30,size=(10,3))
df= pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    26    17     9
1    24    28    29
2    29     7     6
3    21     5    22
4     3     5    13
5     6    25    26
6     2     2    22
7    14    26    20
8    16     3     9
9    12    16     8

In [7]:
#loc : tanımlandığı şekliyle seçim yapmak için kullanılır

In [8]:
df.loc[0:3]

   var1  var2  var3
0    26    17     9
1    24    28    29
2    29     7     6
3    21     5    22

In [10]:
#iloc : alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır

In [12]:
df.iloc[0:3]

   var1  var2  var3
0    26    17     9
1    24    28    29
2    29     7     6

In [14]:
df.iloc[0,0]

26

In [16]:
df

   var1  var2  var3
0    26    17     9
1    24    28    29
2    29     7     6
3    21     5    22
4     3     5    13
5     6    25    26
6     2     2    22
7    14    26    20
8    16     3     9
9    12    16     8

In [15]:
df.iloc[0:3,0:2]

   var1  var2
0    26    17
1    24    28
2    29     7

In [17]:
df.loc[0:3,"var3"]

0     9
1    29
2     6
3    22
Name: var3, dtype: int32

In [20]:
df.iloc[0:3]["var3"]

0     9
1    29
2     6
Name: var3, dtype: int32

# Koşullu Eleman İşlemleri

In [23]:
import numpy as np
import pandas as pd

In [24]:
m = np.random.randint(30,size=(10,3))
df= pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     8    21     9
1    14    27     4
2    29     5    28
3    23    15    20
4    20    19    18
5    21    16    25
6    26     2    21
7    21    14    24
8     9    27    23
9     9     6    14

In [26]:
df["var1"][0:5]

0     8
1    14
2    29
3    23
4    20
Name: var1, dtype: int32

In [27]:
df[0:3][["var2","var3"]]

   var2  var3
0    21     9
1    27     4
2     5    28

In [34]:
df.var3

0     9
1     4
2    28
3    20
4    18
5    25
6    21
7    24
8    23
9    14
Name: var3, dtype: int32

In [28]:
df

   var1  var2  var3
0     8    21     9
1    14    27     4
2    29     5    28
3    23    15    20
4    20    19    18
5    21    16    25
6    26     2    21
7    21    14    24
8     9    27    23
9     9     6    14

In [42]:
df[df.var2>20][["var1","var2"]]

   var1  var2
0     8    21
1    14    27
8     9    27

In [47]:
df[(df.var2>20) & (df.var3 < 10) ]

   var1  var2  var3
0     8    21     9
1    14    27     4

In [50]:
df.loc[(df.var2>15),["var1","var2"]  ]

   var1  var2
0     8    21
1    14    27
4    20    19
5    21    16
8     9    27

In [51]:
df[(df.var2>15)][["var1","var2"]]

   var1  var2
0     8    21
1    14    27
4    20    19
5    21    16
8     9    27

# Birleştirme (Join) İşlemleri

In [56]:
import numpy as np
import pandas as pd

In [57]:
m = np.random.randint(30,size=(5,3))
df1= pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0     2    18    28
1    20    13     3
2    14     6    10
3    12    22     1
4    18    22     1

In [58]:
df2 = df1 + 99
df2

   var1  var2  var3
0   101   117   127
1   119   112   102
2   113   105   109
3   111   121   100
4   117   121   100

In [59]:
pd.concat([df1,df2]) # aynı tabloların birleştirilmesi

   var1  var2  var3
0     2    18    28
1    20    13     3
2    14     6    10
3    12    22     1
4    18    22     1
0   101   117   127
1   119   112   102
2   113   105   109
3   111   121   100
4   117   121   100

In [61]:
pd.concat?

Signature:
pd.concat(
    objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\fettah\pyhton\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [63]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0     2    18    28
1    20    13     3
2    14     6    10
3    12    22     1
4    18    22     1
5   101   117   127
6   119   112   102
7   113   105   109
8   111   121   100
9   117   121   100

In [65]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [67]:
df2.columns=["var1","var2","deg1"]

In [68]:
df2

   var1  var2  deg1
0   101   117   127
1   119   112   102
2   113   105   109
3   111   121   100
4   117   121   100

In [69]:
df1

   var1  var2  var3
0     2    18    28
1    20    13     3
2    14     6    10
3    12    22     1
4    18    22     1

In [70]:
pd.concat([df1,df2])

   var1  var2  var3   deg1
0     2    18  28.0    NaN
1    20    13   3.0    NaN
2    14     6  10.0    NaN
3    12    22   1.0    NaN
4    18    22   1.0    NaN
0   101   117   NaN  127.0
1   119   112   NaN  102.0
2   113   105   NaN  109.0
3   111   121   NaN  100.0
4   117   121   NaN  100.0

In [76]:
pd.concat([df1,df2],join="inner")

   var1  var2
0     2    18
1    20    13
2    14     6
3    12    22
4    18    22
0   101   117
1   119   112
2   113   105
3   111   121
4   117   121

# İleri Birleştirme İşlemleri

In [84]:
import pandas as pd

In [85]:
#birebir birleştirme

In [87]:
df1 =pd.DataFrame({'calisanlar':['Ali','Veli','Ayşe','Fatma'],
                  'grup':['Muhasebe','Mühendislik','Mühendislik','İK']
                  })
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           İK

In [88]:
df2 =pd.DataFrame({'calisanlar':['Ayşe','Ali','Veli','Fatma'],
                  'ilk_giris':[2010,2009,2014,2019]
                  })
df2

  calisanlar  ilk_giris
0       Ayşe       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [93]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

In [95]:
pd.merge(df1,df2,on="calisanlar")

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

In [96]:
#bire çok birleştirme

In [109]:
df3 = pd.merge(df1,df2)

In [110]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayşe  Mühendislik       2010
3      Fatma           İK       2019

In [114]:
df4=pd.DataFrame({'grup':['Muhasebe','Mühendislik','İK'],
                  'mudur':["Caner","Mustafa","Berkcan"]
                 })
df4

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [117]:
pd.merge(df3,df4,on='grup')

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayşe  Mühendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [118]:
# çoktan çoka birleştirme

In [119]:
df5 = pd.DataFrame({'grup': ["Muhasebe","Muhasebe","Mühendislik","Mühendislik","İK","İK"],
                    'yetenekler':["matematik","excel","kodlama","linux","excel","yönetim"]
                   })
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yönetim

In [120]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           İK

In [121]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayşe  Mühendislik    kodlama
5       Ayşe  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yönetim

# 
## Toplulaştırma ve Gruplandırma (Aggregation & Grouping)

##### Basit Toplulaştırma Fonksiyonları :

* count()
* first() 
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [122]:
import seaborn as sns

In [124]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load an example dataset from the online repository (requires internet).

This function provides quick access to a small number of example datasets
that are useful for documenting seaborn or generating reproducible examples
for bug reports. It is not necessary for normal usage.

Note that some of the datasets have a small amount of preprocessing applied
to define a proper ordering for categorical variables.

Use :func:`get_dataset_names` to see a list of available datasets.

Parameters
----------
name : str
    Name of the dataset (``{name}.csv`` on
    https://github.com/mwaskom/seaborn-data).
cache : boolean, optional
    If True, try to load from the local cache first, and save to the cache
    if a download is required.
data_home : string, optional
    The directory in which to cache data; see :func:`get_data_home`.
kws : keys and values, optional
    Additional keyword arguments are passed to passed through to
    :func:`pandas.read_csv`.

Returns
-------
df : :class:`pandas.DataFrame`
    Tabular data, possibly with some preprocessing applied.
File:      c:\users\fettah\pyhton\lib\site-packages\seaborn\utils.py
Type:      function

In [125]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [126]:
df.shape

(1035, 6)

In [127]:
df.size

6210

In [129]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [130]:
df["mass"].mean()

2.6381605847953233

In [131]:
df["mass"].count()

513

In [132]:
df["mass"].min()

0.0036

In [134]:
df["mass"].max()

25.0

In [135]:
df["mass"].sum()

1353.37638

In [136]:
df["mass"].std()

3.8186166509616046

In [137]:
df["mass"].var()

14.58183312700122

In [141]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [142]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [145]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# Gruplama İşlemleri

In [154]:
df = pd.DataFrame({'gruplar':["A","B","C","A","B","C"],
                  'veri':[10,11,52,23,43,55]},
                  columns = ['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [160]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [163]:
df.groupby("gruplar").describe()

         veri
        count  mean        std   min    25%   50%    75%   max
gruplar
A         2.0  16.5   9.192388  10.0  13.25  16.5  19.75  23.0
B         2.0  27.0  22.627417  11.0  19.00  27.0  35.00  43.0
C         2.0  53.5   2.121320  52.0  52.75  53.5  54.25  55.0

In [164]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [165]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [175]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [182]:
df.dropna().groupby("method")["mass"].mean()

method
Radial Velocity    2.511411
Transit            1.470000
Name: mass, dtype: float64

In [184]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## İleri Toplulaştırma  İşlemleri : (Aggregate,Filter,Transform,Apply)

In [12]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
        "gruplar":["A","B","C","A","B","C"],
        "değişken1":[10,23,33,22,11,99],
        "değişken2":[100,253,333,262,111,969],
},columns = ["gruplar","değişken1","değişken2"]
)
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [13]:
#aggregate

In [14]:
df.groupby("gruplar").mean()

         değişken1  değişken2
gruplar
A               16        181
B               17        182
C               66        651

In [26]:
df.groupby("gruplar").median()

         değişken1  değişken2
gruplar
A               16        181
B               17        182
C               66        651

In [25]:
df.groupby("gruplar").aggregate(["min",np.median,max])

        değişken1            değişken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [27]:
df.groupby("gruplar").aggregate({"değişken1":"min","değişken2":max})

         değişken1  değişken2
gruplar
A               10        262
B               11        253
C               33        969

In [29]:
#filter

In [30]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
        "gruplar":["A","B","C","A","B","C"],
        "değişken1":[10,23,33,22,11,99],
        "değişken2":[100,253,333,262,111,969],
},columns = ["gruplar","değişken1","değişken2"]
)
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [31]:
def filter_func(x):
    return x["değişken1"].std() > 9

In [33]:
df.groupby("gruplar").std()

         değişken1   değişken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [32]:
df.groupby("gruplar").filter(filter_func)

  gruplar  değişken1  değişken2
2       C         33        333
5       C         99        969

In [34]:
#transform

In [16]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
        "gruplar":["A","B","C","A","B","C"],
        "değişken1":[10,23,33,22,11,99],
        "değişken2":[100,253,333,262,111,969],
},columns = ["gruplar","değişken1","değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [17]:
df.değişken1*5

0     50
1    115
2    165
3    110
4     55
5    495
Name: değişken1, dtype: int64

In [88]:
df_A = df.iloc[:,1:3]

In [19]:
df.iloc[0]["değişken1"]

10

In [37]:
df_A.transform(lambda x :( x-x.mean())/x.std())

   değişken1  değişken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [36]:
df

  gruplar  değişken1  değişken2        d1        d2
0       A         10        100 -0.687871 -0.738461
1       B         23        253 -0.299074 -0.263736
2       C         33        333  0.000000 -0.015514
3       A         22        262 -0.328982 -0.235811
4       B         11        111 -0.657963 -0.704331
5       C         99        969  1.973890  1.957853

In [38]:
df[["d1","d2"]] = df_A.transform(lambda x :( x-x.mean())/x.std())
df

  gruplar  değişken1  değişken2        d1        d2
0       A         10        100 -0.687871 -0.738461
1       B         23        253 -0.299074 -0.263736
2       C         33        333  0.000000 -0.015514
3       A         22        262 -0.328982 -0.235811
4       B         11        111 -0.657963 -0.704331
5       C         99        969  1.973890  1.957853

In [28]:
df.groupby(df.gruplar).transform(lambda x :x-x.mean())

   değişken1  değişken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [11]:
df

  gruplar  değişken1  değişken2  dem
0       A         10        100    1
1       B         23        253    2
2       C         33        333    3
3       A         22        262    4
4       B         11        111    5
5       C         99        969    6

In [40]:
#apply

In [63]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
        "gruplar":["A","B","C","A","B","C"],
        "değişken1":[10,23,33,22,11,99],
        "değişken2":[100,253,333,262,111,969],
},columns = ["gruplar","değişken1","değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [44]:
df.apply(np.sum)

değişken1     198
değişken2    2028
dtype: int64

In [59]:
df.apply(np.mean)

değişken1     33.0
değişken2    338.0
dtype: float64

In [65]:
df.groupby(df.gruplar).apply(np.sum)

        gruplar  değişken1  değişken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [70]:
import math as mt
dir(mt)

['__doc__',
 '__loader__',
 '__name__',
 '__package__',
 '__spec__',
 'acos',
 'acosh',
 'asin',
 'asinh',
 'atan',
 'atan2',
 'atanh',
 'ceil',
 'comb',
 'copysign',
 'cos',
 'cosh',
 'degrees',
 'dist',
 'e',
 'erf',
 'erfc',
 'exp',
 'expm1',
 'fabs',
 'factorial',
 'floor',
 'fmod',
 'frexp',
 'fsum',
 'gamma',
 'gcd',
 'hypot',
 'inf',
 'isclose',
 'isfinite',
 'isinf',
 'isnan',
 'isqrt',
 'ldexp',
 'lgamma',
 'log',
 'log10',
 'log1p',
 'log2',
 'modf',
 'nan',
 'perm',
 'pi',
 'pow',
 'prod',
 'radians',
 'remainder',
 'sin',
 'sinh',
 'sqrt',
 'tan',
 'tanh',
 'tau',
 'trunc']

In [73]:
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [81]:
# sayısal işlemler için daha uygun aynı işlem transformda yapılacak ise ilk önce dataframe yapılacak işleme göre düzenlenmeli

In [84]:
df.groupby(df.gruplar).apply(lambda x : x+5)

   değişken1  değişken2
0         15        105
1         28        258
2         38        338
3         27        267
4         16        116
5        104        974

# Pivot Tablolar :

In [113]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [111]:
titanic.shape

(891, 15)

In [178]:
titanic.groupby("sex")["survived"].count()

sex
female    314
male      577
Name: survived, dtype: int64

In [169]:
titanic.groupby("sex")["survived"].mean() # kadınların %75 'i  ,  erkeklerin % 18 'i kurtulmuş

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [177]:
titanic[titanic.survived==0].groupby("sex")["survived"].count()

sex
female     81
male      468
Name: survived, dtype: int64

In [133]:
titanic.survived.dtype

dtype('int64')

In [145]:
# ilk önce koşulu tanımla

In [147]:
titanic[ titanic["survived"] == 1 ].groupby("sex").count()["survived"]

sex
female    233
male      109
Name: survived, dtype: int64

In [183]:
titanic[ titanic["survived"] == 1 ].groupby("sex").count()[["survived"]].apply(lambda x :x/titanic.survived.count())
# kurtulanların % 26 ' sı kadın  ,  %12 ' si erkek

        survived
sex
female  0.261504
male    0.122334

In [155]:
titanic.dropna().shape

(182, 15)

In [185]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [186]:
titanic.groupby(["sex","class"])[["survived"]].mean().unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [187]:
# pivot table

In [195]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [197]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [209]:
age = pd.cut(titanic["age"],[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [231]:
titanic.pivot_table("survived",index=["sex",age],columns=["class"])

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663